In [1]:
# initializing libraries

import pandas as pd
import pymysql
from sqlalchemy import create_engine, text
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

**Creating an Engine**

In [2]:
sk = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@localhost:3306/' + sk
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost:3306/sakila)

**Getting a Connection**

In [3]:
with engine.connect() as connection:
    result = connection.execute(text("""
        SELECT * from sakila.actor;
    """)).all()

In [4]:
pd.DataFrame(result)

     actor_id first_name     last_name         last_update
0           1   PENELOPE       GUINESS 2006-02-15 04:34:33
1           2       NICK      WAHLBERG 2006-02-15 04:34:33
2           3         ED         CHASE 2006-02-15 04:34:33
3           4   JENNIFER         DAVIS 2006-02-15 04:34:33
4           5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33
..        ...        ...           ...                 ...
195       196       BELA        WALKEN 2006-02-15 04:34:33
196       197      REESE          WEST 2006-02-15 04:34:33
197       198       MARY        KEITEL 2006-02-15 04:34:33
198       199      JULIA       FAWCETT 2006-02-15 04:34:33
199       200      THORA        TEMPLE 2006-02-15 04:34:33

[200 rows x 4 columns]

In [14]:
def rentals_month(engine, month, year):
    query = f"""
    select customer_id from rental
    where extract(year from rental_date)={year} and extract(month from rental_date)={month};
    """
    with engine.connect() as connection:
        result = connection.execute(text(query)).all()
    
    return pd.DataFrame(result)

In [33]:
def rental_count_month(rental_month, month, year):
    return rental_month.groupby('customer_id').size().rename(f"rentals_{month}_{year}").to_frame()

In [48]:
def compare_rentals(rental_count_month_1, rental_count_month_2):
    result = pd.concat([rental_count_month_1, rental_count_month_2], axis=1).fillna(0)
    result['difference'] = result.iloc[:, 1] - result.iloc[:, 0]
    return result

In [37]:
rm_05_2005 = rentals_month(engine, '05', '2005')
rm_05_2005.sort_values('customer_id')

      customer_id
571             1
75              1
319             2
828             3
433             3
...           ...
623           596
780           596
33            597
512           597
1006          599

[1156 rows x 1 columns]

In [38]:
rm_06_2005 = rentals_month(engine, '06', '2005')
rm_06_2005.sort_values('customer_id')

      customer_id
318             1
2125            1
264             1
1149            1
1204            1
...           ...
1846          598
2239          599
1113          599
1884          599
2270          599

[2311 rows x 1 columns]

In [39]:
rcm_05_2005 = rental_count_month(rm_05_2005, '05', '2005')
rcm_05_2005

             rentals_05_2005
customer_id
1                          2
2                          1
3                          2
5                          3
6                          3
...                      ...
594                        4
595                        1
596                        6
597                        2
599                        1

[520 rows x 1 columns]

In [40]:
rcm_06_2005 = rental_count_month(rm_06_2005, '06', '2005')
rcm_06_2005

             rentals_06_2005
customer_id
1                          7
2                          1
3                          4
4                          6
5                          5
...                      ...
595                        2
596                        2
597                        3
598                        1
599                        4

[590 rows x 1 columns]

In [50]:
compare_rentals(rcm_05_2005, rcm_06_2005)

             rentals_05_2005  rentals_06_2005  difference
customer_id
1                        2.0              7.0         5.0
2                        1.0              1.0         0.0
3                        2.0              4.0         2.0
5                        3.0              5.0         2.0
6                        3.0              4.0         1.0
...                      ...              ...         ...
583                      0.0              6.0         6.0
585                      0.0              4.0         4.0
591                      0.0              3.0         3.0
592                      0.0              5.0         5.0
598                      0.0              1.0         1.0

[598 rows x 3 columns]